---
title: VertexStreamPositionNormalColored
classe: Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormalColored
namespace: Autodesk.Revit.DB.DirectContext3D
eredita: Autodesk.Revit.DB.DirectContext3D.VertexStream
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# VertexStreamPositionNormalColored

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Void AddVertex(VertexPositionNormalColored)` | `vertexStreamPositionNormalColored.AddVertex(vertex)` | Void |
| `Void AddVertices(IList<VertexPositionNormalColored>)` | `vertexStreamPositionNormalColored.AddVertices(vertices)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```